The number of bar positions available in the rebar.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public int NumberOfBarPositions { get; }
  Visual Basic
Public ReadOnly Property NumberOfBarPositions As Integer
	Get
  Visual C++
public:
property int NumberOfBarPositions {
	int get ();
}
 See Also
  RebarInSystem Class
  Autodesk.Revit.DB.Structure Namespace